module.exports = {
  command: ['فريقي'],
  description: 'جروب مطورين الزرف',
  category: 'INFO',

  async execute(sock, msg) {
    const message = `*╭─🌋『 𝐙𝐚𝐫𝐟 𝐓𝐞𝐚𝐦 』🌋─╮*

*👥 من نحن؟*
نحن فريق *مــجــهــول||𝕲𝕳𝕰𝕯𝕬𝕹* ⚔️
نطور بوتات واتساب ذكية، مرنة وآمنة لخدمة الجميع.

*🎯 رؤيتنا:*
- دعم المجتمع العربي بالتقنية والبرمجة.
- بناء بوتات احترافية بلمسة ذوق وفن.
- نشر أدوات مفتوحة المصدر ومساعدة الجميع.

*👑 أبرز الأعضاء:*
- ❄  مــجــهــول||𝕲𝕳𝕰𝕯𝕬𝕹
- 🛡  مــجــهــول||𝕲𝕳𝕰𝕯𝕬𝕹
- 

*📎 روابط مهمة:*
جروب الدعم: nn
البوت الرسمي: wa.me/967 700 821 174

*🧠 استخدم الأمر ( .اوامر ) لتصفح ميزات 🧠*


*╰──────────────╯*`;

    await sock.sendMessage(msg.key.remoteJid, { text: message }, { quoted: msg });
  }
};