const ahadith = [
  `╭───⊰ 📜 *حديث نَبَوِيّ* ⊱───╮
"تَبَسُّمك في وجه أخيك صدقة."
╰────────────╯
❄ 𝒀𝑼𝑴𝑰𝑳𝑨 𝑩𝒐𝒕꧂`,
  `╭───⊰ 📜 *حديث نَبَوِيّ* ⊱───╮
"الدّالّ على الخير كفاعله."
╰────────────╯
❄ 𝒀𝑼𝑴𝑰𝑳𝑨 𝑩𝒐𝒕꧂ `,
  `╭───⊰ 📜 *حديث نَبَوِيّ* ⊱───╮
"لا يؤمن أحدكم حتى يُحب لأخيه ما يحب لنفسه."
╰────────────╯
❄ 𝒀𝑼𝑴𝑰𝑳𝑨 𝑩𝒐𝒕꧂`,
  `╭───⊰ 📜 *حديث نَبَوِيّ* ⊱───╮
"من لا يَرحم لا يُرحم."
╰────────────╯
❄ 𝒀𝑼𝑴𝑰𝑳𝑨 𝑩𝒐𝒕꧂`,
  `╭───⊰ 📜 *حديث نَبَوِيّ* ⊱───╮
"يَسّروا ولا تعسّروا، وبشّروا ولا تنفّروا."
╰────────────╯
❄ 𝒀𝑼𝑴𝑰𝑳𝑨 𝑩𝒐𝒕꧂`
];

module.exports = {
  command: 'احاديث',
  description: '📜 حديث نبوي مزخرف',
  usage: '.أحاديثي',
  category: 'ديني',

  async execute(sock, msg) {
    const text = ahadith[Math.floor(Math.random() * ahadith.length)];
    await sock.sendMessage(msg.key.remoteJid, { text }, { quoted: msg });
  }
};