module.exports = {
  command: 'رعب',
  description: 'يرسل سؤال رعب أو تحدي نفسي',
  category: 'ترفيه',
  usage: '.رعب',
  group: true,

  async execute(sock, msg) {
    const أسئلة = [
      '👁️ لو استيقظت ووجدت كل من في البيت اختفى، من أول شخص تتصل عليه؟',
      '🩸 تخيل فتحت كاميرا المراقبة وشفت شخص يطالعك... إيش تسوي؟',
      '🕯️ الغرفة ظلام دامس، تسمع صوت شخص يقول اسمك... ترد؟',
      '📞 جاك اتصال الساعة 3 فجراً من رقم غريب، ترد؟',
      '🔪 لو أُجبرت تمشي لوحدك بمقبرة الساعة 2 الليل... تمشي ولا تهرب؟',
      '👣 خطوات تُسمع في البيت وأنت وحدك، إيش أول شي تسويه؟',
      '🪞 انعكس شخص غريب في المراية... لكنه مو أنت، كيف تتصرف؟'
    ];

    const عشوائي = أسئلة[Math.floor(Math.random() * أسئلة.length)];

    await sock.sendMessage(msg.key.remoteJid, {
      text: `🕷️ *تحدي رعب:* \n\n${عشوائي}`,
    }, { quoted: msg });
  }
};