module.exports = {
  command: ['فريق'],
  description: 'جروب مطورين الزرف',
  category: 'INFO',

  async execute(sock, msg) {
    const message = `*╭─❄『 𝐙𝐚𝐫𝐟 𝐓𝐞𝐚𝐦 』❄─╮*

*👥 من نحن؟*
نحن فريق *مــجــهــول||𝕲𝕳𝕰𝕯𝕬𝕹* ⚔️
نطور بوتات واتساب ذكية، مرنة وآمنة لخدمة الجميع.

*🎯 رؤيتنا:*
- دعم المجتمع العربي بالتقنية والبرمجة.
- بناء بوتات احترافية بلمسة ذوق وفن.
- نشر أدوات مفتوحة المصدر ومساعدة الجميع.

*👑 أبرز الأعضاء:*
- ❄️ غوجو 
- 🔥 مايكي
- 🪶 ايتاشي 
- 🩸 كانيكي
- 🦅 كيريتو
- 🌋 اسكانور
- 🕵️ رينتارو
- 🦋 ميتسوري

*📎 روابط مهمة:*
جروب الدعم: nn
البوت الرسمي: wa.me/967715677073

*☀️ استخدم الأمر ( .اوامر ) لتصفح ميزات ☀️*

مــجــهــول||𝕲𝕳𝕰𝕯𝕬𝕹 𝑩𝑶𝑻 ❄
*╰──────────────╯*`;

    await sock.sendMessage(msg.key.remoteJid, { text: message }, { quoted: msg });
  }
};