module.exports = {
  command: 'قوانين',
  description: 'يعرض قوانين القروب',
  category: 'group',

  async execute(sock, msg) {
    try {
      const chatJid = msg.key.remoteJid;

      const rulesText = `
*【الـقـوانـيـن】*

*⓵『الـمـخـالــفـات/الانــذارات』⓵*

*⊱┈ ┄ ┉┉┅┅━━✥🌟✥━━┅┅┉┉ ┈ ┈⊰*

*1-ارسال gif برا الانمي*
*2- ممنــوع ارسال ملصقات مخله للاداب*
*3- 3 ملصقات ورا بعض بدون رسايل سبام*
*4- 9 رسائل ورا بعض 3 منها دون فائدة سبام*
*5- السبام و التشفير*
*6ـ التحدث عن الهنتاي و الإيتشي*
*8ـ العنصرية بكل أشكالها*
*9ـ التحدث في الامور السياسية ونحوها*
*10- التحدث عن حلقة لم يمر عليها 7 ساعات*
*11- التنمر على الاعضاء*
*12- الصوتيات عالية الصوت المزعجه*
*13- طلب رتبة وازعاج المسؤولين*
*14-ممنوع تكلم ب لهجة غير العامة + ممنوع تتكلم ب لغة غير العربية*

*⊱┈ ┄ ┉┉┅┅━━✥🌟✥━━┅┅┉┉ ┈ ┈⊰*

‏ *‏⓶『قـوانــيـن الـطــرد الـمـؤقـت』⓶*

*1-الحرق بجميع صوره*
*2-الإعتراض على قرارات المشرفين و التدخل فيها*

*مـلاحــظة*
*اذا اخذت طردين راح يتحول الى مؤبد*

*⊱┈ ┄ ┉┉┅┅━━✥🌟✥━━┅┅┉┉ ┈ ┈⊰*

‏ *‏⓷『قـوانــيـن الـطــرد الـمـؤبـد』⓷*

*1- النشر لقروب آخر*
*2- إرسال أي صورة أو مقطع أو ملصق هنتاي*
*3- الدخول بنية التخريب أو سرقة الأعضاء*
*4- تهديد الاعضاء بالباند وغيرها*
*5- السب والشتم القوي*
*6- افتعال مشاكل متعمدة بالنقابة*
*7-تغلط على شخص بالخاص او تبتزة بشكل عام واشتكى عليك*
*8- إرسال صورة أو مقطع غير لائق سواءً كان من إنمي أو غير الإنمي*

*مـلاحــظـة*
*↜4 | إنذارات =   طرد لمـدة يومين*
*↜6 | إنذارات =   طرد مؤبـد*

~*تـحـذيـر هــام*~
*-يستطيع المشرف طردك موبد ذا انت تكرر نفس الإنذارات* 
*-إذا لزم الأمر يمكن للمشرف أن يطبق قانون غير مذكور !*

*⊱┈ ┄ ┉┉┅┅━━✥🌟✥━━┅┅┉┉ ┈ ┈⊰*

*تنحذف الانذارات بعد 3 ايام من اخذها*
*♢━━━⋗〔🌟〕⋖━━━♢*
      `;

      await sock.sendMessage(chatJid, {
        text: rulesText
      }, { quoted: msg });

    } catch (err) {
      console.error("خطأ في أمر .قوانين:", err);
      await sock.sendMessage(msg.key.remoteJid, {
        text: "⚠️ حصل خطأ أثناء تنفيذ الأمر."
      }, { quoted: msg });
    }
  }
};